namespace SnakeGame
{
    internal class Program
    {

        // 뱀은 매턴마다 자신의 앞으로 이동합니다.
        // 사용자는 방향키를 이용하여 뱀의 이동 방향을 제어할 수 있습니다.
        // 뱀은 맵에 무작위로 생성되는 음식을 먹을 수 있습니다.
        // 뱀은 벽이나 자신의 몸에 부딪히면 게임이 끝나고 'Game Over' 메시지가 뜹니다.


        // Main 함수에서 게임을 제어하는 코드를 작성합니다 : 뱀의 이동, 음식 먹기, 게임 오버 조건 확인 등을 주기적으로 수행합니다.
        static void Main(string[] args)
        {

        }
    }

    // Snake 클래스를 만듭니다 : 뱀의 상태와 이동, 음식 먹기, 자신의 몸에 부딪혔는지 확인 등의 기능을 담당합니다.

    // FoodCreator 클래스를 만듭니다 : 이 클래스는 맵의 크기 내에서 무작위 위치에 음식을 생성하는 역할을 합니다.
}